index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Emacs-Guix</title>
<!-- 2017-04-19 Wed 23:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/default.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Emacs-Guix</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">About</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Emacs-Guix</code> (aka <code>guix.el</code>) is an Emacs interface for <a href="http://www.gnu.org/software/guix/">GNU Guix</a> package
manager.
</p>

<p>
Emacs-Guix allows you to manage your Guix profile(s): to install,
upgrade and remove packages, to switch and remove profile generations,
to display all available info about packages and to do many other
things.
</p>

<p>
Source code: <a href="https://github.com/alezost/guix.el">https://github.com/alezost/guix.el</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Documentation</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Version</th>
<th scope="col" class="left">Entirely on one web page</th>
<th scope="col" class="left">One web page per node</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Latest (from git)</td>
<td class="left"><a href="./manual/git/emacs-guix.html">html</a></td>
<td class="left"><a href="./manual/git/html_node/index.html">html</a></td>
</tr>

<tr>
<td class="left">0.3</td>
<td class="left"><a href="./manual/0.3/emacs-guix.html">html</a></td>
<td class="left"><a href="./manual/0.3/html_node/index.html">html</a></td>
</tr>
</tbody>
</table>

<p>
The above HTML pages were generated from a Texinfo manual that comes
with Emacs-Guix.  Since you probably use Emacs, you can always read this
manual by following Emacs-Guix entry in <code>C-h i</code> (<code>M-x info</code>) or simply
with <code>M-x guix-info</code>.
</p>
</div>
</div>
</div>
</body>
</html>
